clear all; %清除所有变量
close all; %清图
clc ;      %清屏


% E=[116.46   121.48  106.54   91.11   87.68   126.63   113.65   114.31   113.23   104.06   108.95  102.73];
% N=[39.92   31.22    29.59    29.97   43.77   45.75     34.76    30.52    23.16   30.67    34.27   25.04];
%P=['北京';'上海';'重庆';'拉萨';'乌鲁木齐';'哈尔滨';'郑州';'武汉';'广州';'成都';'西安';'昆明'];
city = [
87.68,43.77;  %乌鲁木齐
91.11,29.97; %拉萨
102.73,25.04; %昆明
104.06,30.67; %成都
106.54,29.59; %重庆
108.95,34.27; %西安
113.65,34.76; %郑州
114.31,30.52; %武汉
113.23,23.16; %广州&深圳
116.46,39.92; %北京&天津
121.48,31.22; %上海
126.63,45.75   %哈尔滨
]; 



n = size(city,1);                                                %城市距离初始化
D = zeros(n,n);  
D(1,2)=2668;
D(1,3)=3865;
D(1,4)=2914;
D(1,5)=3202;
D(1,6)=2541;
D(1,7)=3027;
D(1,8)=3323;
D(1,9)=4316;
D(1,10)=3300;
D(1,11)=3929;
D(1,12)=4531;
D(2,3)=2246;
D(2,4)=2106;
D(2,5)=2457;
D(2,6)=2775;
D(2,7)=3254;
D(2,8)=3500;
D(2,9)=4148;
D(2,10)=3736;
D(2,11)=4157;
D(2,12)=4967;
D(3,4)=917;
D(3,5)=973;
D(3,6)=3475;
D(3,7)=2100;
D(3,8)=1834;
D(3,9)=1585;
D(3,10)=2907;
D(3,11)=2529;
D(3,12)=4126;
D(4,5)=356;
D(4,6)=798;
D(4,7)=1278;
D(4,8)=1455;
D(4,9)=2047;
D(4,10)=1881;
D(4,11)=2181;
D(4,12)=3099;
D(5,6)=847;
D(5,7)=1326;
D(5,8)=1078;
D(5,9)=1710;
D(5,10)=3026;
D(5,11)=1945;
D(5,12)=3156;
D(6,7)=478;
D(6,8)=813;
D(6,9)=1760;
D(6,10)=1092;
D(6,11)=1381;
D(6,12)=2309;
D(7,8)=569;
D(7,9)=1516;
D(7,10)=695;
D(7,11)=943;
D(7,12)=1914;
D(8,9)=1021;
D(8,10)=1171;
D(8,11)=908;
D(8,12)=2389;
D(9,10)=2179;
D(9,11)=1539;
D(9,12)=3383;
D(10,11)=1239;
D(10,12)=1230;
D(11,12)=2342;

for i=1:n
    for j=i+1:n
        D(j,i)=D(i,j);
    end
end
        
population(1)=3.1;
population(2)=0.6;
population(3)=6.4;
population(4)=14.0;
population(5)=28.8;
population(6)=8.5;
population(7)=8.6;
population(8)=9.8;
population(9)=12.7+10.4;
population(10)=19.6+12.9;
population(11)=23.0;
population(12)=10.6;


D_2 = zeros(n,n);

for i=1:n
    for j=1:n
        if i==j
            D(i,j)=0;
        elseif D(i,j)<=600
            D(i,j)=32*sqrt(population(i)*population(j));
            D_1(i,j)=32;
            D_2(i,j)=400;           
        elseif D(i,j)<=1200
            D(i,j)=16*sqrt(population(i)*population(j));
            D_1(i,j)=16;
            D_2(i,j)=200;
        elseif D(i,j)<=3000 
            D(i,j)=8*sqrt(population(i)*population(j));
            D_1(i,j)=8;
            D_2(i,j)=100;
        else
            D(i,j)=0;
        end
        
    end
end

s=0;
for i=1:n
    for j=i:n
        if D(i,j) ~= 0 
            s = s+1;
            NV(s) = D(i,j);
            NV_city_1(s)  = i;         
            NV_city_2(s)  = j;
        end
    end
end

a = [NV;NV_city_1;NV_city_2]';
b = sortrows(a,1);
c=b;
s_1 = 1;
NV_total = 0;

for i=1:n
    flag(n)=0;
end


figure(1)
for i=1:46
    if  flag(b((47-i),2)) ~=1 || flag(b((47-i),3)) ~=1
            flag(b((47-i),2)) =1;
            flag(b((47-i),3)) =1;
            NV_total = b((47-i),1)+NV_total;
            b((47-i),1) = 0;
            s_1 = s_1 +1;
            hold on,plot([city(b((47-i),2),1);city(b((47-i),3),1)],[city(b((47-i),2),2);city(b((47-i),3),2)]);
    end
end

c = sortrows(b,1);
for i=1:46
    if s_1<=16
        NV_total = c((47-i),1)+NV_total;
        s_1 = s_1 +1;
        hold on,plot([city(c((47-i),2),1);city(c((47-i),3),1)],[city(c((47-i),2),2);city(c((47-i),3),2)]);
    end
end

for i=1:12
    hold on,plot(city(:,1),city(:,2),'ro');
end

title('光传送网络规划  连接数=16')
save 18_B.mat
